app/views/genres/index.html.erb

				<% end %>
				<% genre.idea_boards.order("id DESC").each_with_index do |idea, i| %>
---
SELECT "idea_boards".* FROM "idea_boards" WHERE "idea_boards"."genre_id" = ? ORDER BY id DESC  [["genre_id", 1]]