app/views/favorites/_like_button.html.erb

SELECT  "favorites".* FROM "favorites" WHERE "favorites"."user_id" = ? AND "favorites"."idea_board_id" = ? LIMIT ?  [["user_id", 1], ["idea_board_id", 5], ["LIMIT", 1]]
---
<% if current_user.favpost?(idea_board) %>
  <%= form_for(current_user.favorites.find_by(idea_board_id: idea_board.id), html: { method: :delete }) do |f| %>