app/views/favorites/index.html.erb

					<% @favorites.each do |fav| %>
						<% idea = IdeaBoard.find(fav.idea_board_id) %>
---
SELECT  "idea_boards".* FROM "idea_boards" WHERE "idea_boards"."id" = ? LIMIT ?  [["id", 4], ["LIMIT", 1]]