app/views/users/show.html.erb

			<div>
				<% @user.idea_boards.each do |idea| %>
---
SELECT "idea_boards".* FROM "idea_boards" WHERE "idea_boards"."user_id" = ?  [["user_id", 1]]