app/views/users/show.html.erb

SELECT "idea_boards".* FROM "idea_boards" WHERE "idea_boards"."user_id" = ? ORDER BY id DESC  [["user_id", 1]]
---
				<div class="card-body bg-body">
					<% @user.idea_boards.order("id DESC").each do |idea| %>