app/views/idea_boards/edit.html.erb

                      <td class="bg-white">
                        <%= f.collection_select :genre_id, Genre.all, :id, :genre_symbol, :prompt => "ジャンルを選択してください", class: "select" %>
---
SELECT "genres".* FROM "genres"