app/controllers/comments_controller.rb

SELECT  "idea_boards".* FROM "idea_boards" WHERE "idea_boards"."id" = ? LIMIT ?  [["id", 5], ["LIMIT", 1]]
INSERT INTO "comments" ("user_id", "idea_board_id", "text", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["user_id", 1], ["idea_board_id", 5], ["text", "これはテストのコメントです"], ["created_at", "2019-08-20 11:50:05.175749"], ["updated_at", "2019-08-20 11:50:05.175749"]]
---
	def create
		@idea_board = IdeaBoard.find(params[:idea_board_id])
		@comment = @idea_board.comments.build(comment_params)
		@comment.user = current_user
		if @comment.save