app/controllers/favorites_controller.rb

SELECT `genres`.* FROM `genres`
SELECT "favorites".* FROM "favorites" WHERE "favorites"."user_id" = ?  [["user_id", 1]]
---
  def index
    @idea_board = IdeaBoard.new
    @genres = Genre.all
    @user = current_user
    @favorites = Favorite.where(user_id: @user.id).all

SELECT  "idea_boards".* FROM "idea_boards" WHERE "idea_boards"."id" = ? LIMIT ?  [["id", 4], ["LIMIT", 1]]
---
	def create
    @genres = Genre.all
    idea_board = IdeaBoard.find(params[:idea_board_id])

SELECT  "idea_boards".* FROM "idea_boards" WHERE "idea_boards"."id" = ? LIMIT ?  [["id", 4], ["LIMIT", 1]]
---
  def destroy
    idea_board = IdeaBoard.find(params[:idea_board_id])