app/controllers/genres_controller.rb

	def index
		@genres = Genre.all
---
SELECT `genres`.* FROM `genres`

	def show
		@genres = Genre.all
		@genre = Genre.find(params[:id])
		@idea_boards = @genre.idea_boards.page(params[:page]).per(20).order(created_at: :desc)
---
SELECT `genres`.* FROM `genres`
SELECT  "genres".* FROM "genres" WHERE "genres"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
SELECT  "idea_boards".* FROM "idea_boards" WHERE "idea_boards"."genre_id" = ? ORDER BY "idea_boards"."created_at" DESC LIMIT ? OFFSET ?  [["genre_id", 1], ["LIMIT", 20], ["OFFSET", 0]]