app/controllers/homes_controller.rb

SELECT `genres`.* FROM `genres`
---
	def top
		@idea_board = IdeaBoard.new
		@genres = Genre.all

SELECT "genres".* FROM "genres"
---
	def about
		@idea_board = IdeaBoard.new
		@genres = Genre.all