app/controllers/idea_boards_controller.rb

INSERT INTO "idea_boards" ("user_id", "genre_id", "head", "body", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?)  [["user_id", 1], ["genre_id", 1], ["head", "戦略性の高いFPSがやりたい"], ["body", "RS6以来の戦略性の高いFPSをプレイしたい"], ["created_at", "2019-08-22 05:25:58.239863"], ["updated_at", "2019-08-22 05:25:58.239863"]]
---
	def create
		@idea_board = IdeaBoard.new(idea_board_params)
		@idea_board.user_id = current_user.id
		if@idea_board.save

SELECT `genres`.* FROM `genres`
SELECT  "idea_boards".* FROM "idea_boards" ORDER BY "idea_boards"."created_at" DESC LIMIT ? OFFSET ?  [["LIMIT", 20], ["OFFSET", 0]]
---
	def index
		@genres = Genre.all
		@idea_board = IdeaBoard.new
		if params[:tag]
			@idea_boards = IdeaBoard.tagged_with(params[:tag]).page(params[:page]).per(20).order(created_at: :desc)

SELECT `genres`.* FROM `genres`
SELECT  "idea_boards".* FROM "idea_boards" WHERE "idea_boards"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
---
	def show
		@genres = Genre.all
		@idea_board = IdeaBoard.find(params[:id])

SELECT `genres`.* FROM `genres`
SELECT  "idea_boards".* FROM "idea_boards" WHERE "idea_boards"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
---
	def edit
		@idea_board = IdeaBoard.new
		@genres = Genre.all
		@idea_board = IdeaBoard.find(params[:id])

SELECT  "idea_boards".* FROM "idea_boards" WHERE "idea_boards"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
UPDATE "idea_boards" SET "head" = ?, "updated_at" = ? WHERE "idea_boards"."id" = ?  [["head", "オープンワールドのハクスラFPS"], ["updated_at", "2019-08-21 15:36:58.326065"], ["id", 1]]
---
	def update
		@idea_board = IdeaBoard.find(params[:id])
		if @idea_board.update(idea_board_params)

SELECT  "idea_boards".* FROM "idea_boards" WHERE "idea_boards"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
---
	def destroy
		@idea_board = IdeaBoard.find(params[:id])