app/controllers/messages_controller.rb

	def create
		if Entry.where(:user_id => current_user.id, :room_id => params[:message][:room_id]).present?
		  @message = Message.create(params.require(:message).permit(:user_id, :content, :room_id).merge(:user_id => current_user.id))
---
SELECT "entries".* FROM "entries" WHERE "entries"."user_id" = ? AND "entries"."room_id" = ?  [["user_id", 2], ["room_id", 1]]
INSERT INTO "messages" ("user_id", "room_id", "content", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["user_id", 2], ["room_id", 1], ["content", "こんにちわ"], ["created_at", "2019-08-21 05:07:00.020352"], ["updated_at", "2019-08-21 05:07:00.020352"]]