app/controllers/rooms_controller.rb

INSERT INTO "rooms" ("created_at", "updated_at") VALUES (?, ?)  [["created_at", "2019-08-21 04:38:28.921629"], ["updated_at", "2019-08-21 04:38:28.921629"]]
INSERT INTO "entries" ("user_id", "room_id", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["user_id", 2], ["room_id", 1], ["created_at", "2019-08-21 04:38:28.945585"], ["updated_at", "2019-08-21 04:38:28.945585"]]
INSERT INTO "entries" ("user_id", "room_id", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["user_id", 1], ["room_id", 1], ["created_at", "2019-08-21 04:38:28.963259"], ["updated_at", "2019-08-21 04:38:28.963259"]]
---
	def create
	    @room = Room.create
	    @entry1 = Entry.create(:room_id => @room.id, :user_id => current_user.id)
	    @entry2 = Entry.create(params.require(:entry).permit(:user_id, :room_id).merge(:room_id => @room.id))

SELECT "genres".* FROM "genres"
SELECT  "rooms".* FROM "rooms" WHERE "rooms"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
SELECT "entries".* FROM "entries" WHERE "entries"."user_id" = ? AND "entries"."room_id" = ?  [["user_id", 2], ["room_id", 1]]
---
	def show
		@genres = Genre.all
		@idea_board = IdeaBoard.new
	    @room = Room.find(params[:id])
	    if Entry.where(:user_id => current_user.id, :room_id => @room.id).present?

SELECT `genres`.* FROM `genres`
SELECT "entries".* FROM "entries" WHERE "entries"."user_id" = ?  [["user_id", 2]]
---
	def index
		@genres = Genre.all
		@idea_board = IdeaBoard.new
		@user = current_user
		@currentEntries = current_user.entries
		myRoomIds = []

		@currentEntries.each do |entry|