app/controllers/users_controller.rb

SELECT `genres`.* FROM `genres`
SELECT  "users".* FROM "users" WHERE "users"."id" = ? ORDER BY "users"."id" ASC LIMIT ?  [["id", 1], ["LIMIT", 1]]
SELECT "entries".* FROM "entries" WHERE "entries"."user_id" = ?  [["user_id", 2]]
SELECT "entries".* FROM "entries" WHERE "entries"."user_id" = ?  [["user_id", 1]]
SELECT COUNT(*) FROM "idea_boards" WHERE "idea_boards"."user_id" = ?  [["user_id", 1]]
---
  def show
      @idea_board = IdeaBoard.new
      @genres = Genre.all
  	  @user = User.find(params[:id])
      @currentUserEntry=Entry.where(user_id: current_user.id)
      @userEntry=Entry.where(user_id: @user.id)
      if @user.id == current_user.id
      else
        @currentUserEntry.each do |cu|
          @userEntry.each do |u|
            if cu.room_id == u.room_id then
              @isRoom = true
              @roomId = cu.room_id
            end
          end
        end
        if @isRoom
        else
          @room = Room.new
          @entry = Entry.new
        end
      end
        @idea_boards = @user.idea_boards.page(params[:page]).per(20).order(created_at: :desc)

SELECT  "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
---
  def edit
      @idea_board = IdeaBoard.new
  	  @user = User.find(params[:id])

SELECT  "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
UPDATE "users" SET "image_id" = ?, "updated_at" = ? WHERE "users"."id" = ?  [["image_id", "2897342db3dc274efb77a025098f8338f74a6d79383d37bbaf19c3f22e18"], ["updated_at", "2019-08-18 04:23:49.838963"], ["id", 1]]
---
  def update
      @user = User.find(params[:id])
      if @user.update(user_params)