app/models/user.rb

  	def like(idea_board)
    favorites.find_or_create_by(idea_board_id: idea_board.id)
---
INSERT INTO "favorites" ("user_id", "idea_board_id", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["user_id", 1], ["idea_board_id", 5], ["created_at", "2019-08-19 03:51:02.572170"], ["updated_at", "2019-08-19 03:51:02.572170"]]

	def unlike(idea_board)
	favorite = favorites.find_by(idea_board_id: idea_board.id)
	favorite.destroy if favorite
---
DELETE FROM "favorites" WHERE "favorites"."id" = ?  [["id", 1]]