app/views/layouts/application.html.erb

                      <td style="width:70%">
                        <%= f.collection_select :genre_id, Genre.all, :id, :genre_symbol, :prompt => "ジャンルを選択してください", class: "select" %>
---
SELECT "genres".* FROM "genres"